#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.feast.helm_release.feast will be created
  + resource "helm_release" "feast" {
      + atomic                     = false
      + chart                      = "feast"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = true
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "combinator"
      + namespace                  = "feast"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://feast-helm-charts.storage.googleapis.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "feast-core":
                  "postgresql":
                    "existingSecret": "combinator-postgres-secret"
                "feast-jupyter":
                  "enabled": true
                "feast-serving":
                  "enabled": true
                "grafana":
                  "enabled": false
                "kafka":
                  "enabled": false
                "postgresql":
                  "existingSecret": "combinator-postgres-secret"
                "redis":
                  "enabled": true
            EOT,
        ]
      + verify                     = false
      + version                    = "0.100.4"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.feast.kubernetes_namespace.namespace will be created
  + resource "kubernetes_namespace" "namespace" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "feast"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.feast.kubernetes_secret.feast-postgres-secret will be created
  + resource "kubernetes_secret" "feast-postgres-secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "combinator-postgres-secret"
          + namespace        = "feast"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.feast.random_password.feast-postgres-password will be created
  + resource "random_password" "feast-postgres-password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @philwinder, Action: `pull_request`, Working Directory: ``, Workflow: `terraform`*